In [1]:
import pandas as pd

### Loading csv file

In [2]:
df=pd.read_csv("data/sample_data.csv")
df.head()

      name   age  height
0  Sheldon  28.0   186.0
1  Leonard  28.0   165.0
2   Howard   NaN   163.0
3      Raj   NaN   171.0
4    Penny  22.0     NaN

### Loading excel sheet

In [3]:
#!pip install xlrd

In [4]:
df = pd.read_excel("data/sample_data.xlsx")
df.head()

      name   age  height
0  Sheldon  28.0   186.0
1  Leonard  28.0   165.0
2   Howard   NaN   163.0
3      Raj   NaN   171.0
4    Penny  22.0     NaN

### Parsing html data

In [5]:
url = "https://en.wikipedia.org/wiki/States_and_union_territories_of_India"
tables_list = pd.read_html(url)

In [6]:
#checking no of tables found
len(tables_list)

9

In [7]:
#printing required table by indexing
state_table = tables_list[3]
state_table.head()

,State,ISO 3166-2:IN,Vehiclecode,Zone,Capital,Largest city,Statehood,Population[40],Area(km2),Officiallanguages[41],Additional officiallanguages[41]
0,Andhra Pradesh,IN-AP,AP,Southern,Hyderabad (de jure)Amaravati (de facto) Note 1...,Visakhapatnam,1 November 1956,49506799,160205,Telugu,—
1,Arunachal Pradesh,IN-AR,AR,North-Eastern,Itanagar,Itanagar,20 February 1987,1383727,83743,English,—
2,Assam,IN-AS,AS,North-Eastern,Dispur,Guwahati,26 January 1950,31205576,78550,Assamese,"Bengali, Bodo"
3,Bihar,IN-BR,BR,Eastern,Patna,Patna,26 January 1950,104099452,94163,Hindi,Urdu
4,Chhattisgarh,IN-CT,CG,Central,Naya Raipur,Raipur,1 November 2000,25545198,135194,Hindi,—

### Read from clipborad

#### copy following text  
```
     bar   foo  
0    4     1  
1    5     2  
2    6     3  
```

In [8]:
df = pd.read_clipboard()
df

   bar  foo
0    4    1
1    5    2
2    6    3